###################################################################

# Created by write_sdc on Fri Feb 19 15:15:45 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[31]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[30]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[29]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[28]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[27]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[26]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[25]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[24]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[23]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[22]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[21]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[20]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[19]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[18]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[17]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[16]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[15]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[14]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[13]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[12]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[11]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[10]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[9]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[8]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[7]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[6]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[5]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[4]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[3]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[2]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[1]}]
set_load -pin_load 3.40189 [get_ports {OUTALU_IN_MEM[0]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[31]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[30]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[29]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[28]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[27]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[26]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[25]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[24]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[23]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[22]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[21]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[20]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[19]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[18]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[17]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[16]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[15]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[14]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[13]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[12]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[11]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[10]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[9]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[8]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[7]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[6]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[5]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[4]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[3]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[2]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[1]}]
set_load -pin_load 3.40189 [get_ports {DATAMEM_IN_MEM[0]}]
set_load -pin_load 3.40189 [get_ports MEM_EN]
set_load -pin_load 3.40189 [get_ports READNOTWRITE]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[31]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[30]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[29]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[28]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[27]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[26]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[25]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[24]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[23]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[22]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[21]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[20]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[19]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[18]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[17]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[16]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[15]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[14]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[13]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[12]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[11]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[10]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[9]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[8]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[7]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[6]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[5]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[4]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[3]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[2]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[1]}]
set_load -pin_load 3.40189 [get_ports {PC_TO_IMEM[0]}]
create_clock [get_ports CLK]  -name MY_CLK  -period 1.74  -waveform {0 0.87}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports RST]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEMD_OUT_MEM[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION_OUT_IF[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUTALU_IN_MEM[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PC_TO_IMEM[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATAMEM_IN_MEM[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports MEM_EN]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports READNOTWRITE]
